l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc177x_8x_mmcard_sdio.c
/*
 * Copyright (C) 2012 by Rob van Lieshout (info@pragmalab.nl)
 * Copyright (C) 2012 by Ole Reinhardt (ole.reinhardt@embedded-it.de)
 * Copyright (C) 2008 by egnite GmbH.
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holders nor the names of
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
 * THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * For additional information see http://www.ethernut.de/
 */

/*!
 * \brief Basic block device driver for multimedia cards.
 *
 * The driver uses SDIO mode, 4-bit bus
 *
 */

#include <cfg/mmci.h>
#include <errno.h>
#include <string.h>
#include <stdlib.h>

#include <sys/heap.h>
#include <sys/timer.h>
#include <sys/event.h>
#include <fs/dospart.h>
#include <fs/fs.h>

#include <dev/blockdev.h>

#include "arch/cm3/nxp/lpc177x_8x_mmcard_sdio.h"
#include "arch/cm3/nxp/lpc177x_8x_mci.h"

#ifdef NUTDEBUG
    #include <stdio.h>
#endif

/*!
 * \addtogroup Card
 */
/*@{*/

typedef struct _MCIFC
{
    uint32_t ifc_config;        /*! \brief Configuration flags. */
    uint32_t ifc_opcond;        /*! \brief Operating conditions. */
    uint32_t ifc_reladdr;       /*! \brief Relative card address. */
    uint8_t *ifc_buff;          /*! \brief Pointer to sector buffer. */
    uint32_t ifc_csd[4];        /*! \brief Card Specific Data CSD. */
    //uint32_t ifc_cid[4];        /*! \brief Card identification. */
    uint8_t  ifc_admode;        /*! \brief adressing mode */
} MCIFC;


/*!
 * \brief Local multimedia card mount information.
 */
typedef struct _MMCFCB
{
    /*! \brief Attached file system device.
     */
    NUTDEVICE *fcb_fsdev;

    /*! \brief Partition table entry of the currently mounted partition.
     */
    DOSPART fcb_part;

    /*! \brief Next block number to read.
     *
     * The file system driver will send a NUTBLKDEV_SEEK control command
     * to set this value before calling the read or the write routine.
     *
     * The number is partition relative.
     */
    uint32_t fcb_blknum;

    /*! \brief Internal block buffer.
     *
     * A file system driver may use this one or optionally provide it's
     * own buffers.
     *
     * Minimal systems may share their external bus interface with
     * device I/O lines, in which case the buffer must be located
     * in internal memory.
     */
    u_char fcb_blkbuf[MMC_BLOCK_SIZE];
} MMCFCB;

/* Flags to check whether a partition table is present or not */

#define MBR_P_TABLE_PRESENT     0
#define MBR_P_TABLE_NOT_PRESENT 1


/*
 * Several routines call NutSleep, which results in a context switch.
 * This mutual exclusion semaphore takes care, that multiple threads
 * do not interfere with each other.
 */
static HANDLE mutex;
static MCIFC mci0_ifc;
static st_Mci_CardId cidval;

/* local routines */
static uint32_t Lpc177x_8x_MmcardWriteData(uint8_t*, int, int);
static uint32_t Lpc177x_8x_MmcardReadData(uint8_t*, int, int);
static int      Lpc177x_8x_MmcardUnmount(NUTFILE * nfp);

#ifdef NUTDEBUG
static void Lpc177x_8x_MmcardShowStatusBits(uint32_t);
#endif

/*-------------------------------------------------------------------------*/
/*                         start of code                                   */
/*-------------------------------------------------------------------------*/


#ifdef NUTDEBUG
/************************************************************************//**
 * \brief       Show status bits for MCI_status word
 *
 * \param       None
 *
 * \return      None
 ****************************************************************************/
static void Lpc177x_8x_MmcardShowStatusBits(uint32_t MCIStatus)
{
    if (MCIStatus & MCI_CMD_CRC_FAIL)
    {
        printf("MCI_CMD_CRC_FAIL\n");
    }
    if (MCIStatus & MCI_DATA_CRC_FAIL)
    {
        printf("MCI_DATA_CRC_FAIL\n");
    }
    if (MCIStatus & MCI_CMD_TIMEOUT)
    {
        printf("MCI_CMD_TIMEOUT\n");
    }
    if (MCIStatus & MCI_DATA_TIMEOUT)
    {
        printf("MCI_DATA_TIMEOUT\n");
    }
    if (MCIStatus & MCI_TX_UNDERRUN)
    {
        printf("MCI_TX_UNDERRUN\n");
    }
    if (MCIStatus & MCI_RX_OVERRUN)
    {
        printf("MCI_RX_OVERRUN\n");
    }
    if (MCIStatus & MCI_CMD_RESP_END)
    {
        printf("MCI_CMD_RESP_END\n");
    }
    if (MCIStatus & MCI_CMD_SENT)
    {
        printf("MCI_CMD_SENT\n");
    }
    if (MCIStatus & MCI_DATA_END)
    {
        printf("MCI_DATA_END\n");
    }
    if (MCIStatus & MCI_START_BIT_ERR)
    {
        printf("MCI_START_BIT_ERR\n");
    }
    if (MCIStatus & MCI_DATA_BLK_END)
    {
        printf("MCI_DATA_BLK_END\n");
    }
    if (MCIStatus & MCI_CMD_ACTIVE)
    {
        printf("MCI_CMD_ACTIVE\n");
    }
    if (MCIStatus & MCI_TX_ACTIVE)
    {
        printf("MCI_TX_ACTIVE\n");
    }
    if (MCIStatus & MCI_RX_ACTIVE)
    {
        printf("MCI_RX_ACTIVE\n");
    }
    if (MCIStatus & MCI_TX_HALF_EMPTY)
    {
        printf("MCI_TX_HALF_EMPTY\n");
    }
    if (MCIStatus & MCI_RX_HALF_FULL)
    {
        printf("MCI_RX_HALF_FULL\n");
    }
    if (MCIStatus & MCI_TX_FIFO_FULL)
    {
        printf("MCI_TX_FIFO_FULL\n");
    }
    if (MCIStatus & MCI_RX_FIFO_FULL)
    {
        printf("MCI_RX_FIFO_FULL\n");
    }
    if (MCIStatus & MCI_TX_FIFO_EMPTY)
    {
        printf("MCI_TX_FIFO_EMPTY\n");
    }
    if (MCIStatus & MCI_RX_FIFO_EMPTY)
    {
        printf("MCI_RX_FIFO_EMPTY\n");
    }
    if (MCIStatus & MCI_TX_DATA_AVAIL)
    {
        printf("MCI_TX_DATA_AVAIL\n");
    }
    if (MCIStatus & MCI_RX_DATA_AVAIL)
    {
        printf("MCI_RX_DATA_AVAIL\n");
    }
}
#endif

/*!
 * \brief read n-blocks of data, starting at blocknum. Wait for ending!
 *
 * \param buffer Pointer to the data buffer to fill.
 * \param blk    first blocknumber to read
 * \param num    Maximum number of blocks to write. Please note the buffer
 *               should be able to contain the data. No boundery test is performed
 *
 * \return A return value of <0 indicates an error.
 */
static uint32_t Lpc177x_8x_MmcardReadData(uint8_t* buffer, int blk, int num)
{
    int32_t  retVal;
    uint32_t errorState;
    int      retry = 1;


    /* Gain mutex access. */
    NutEventWait(&mutex, 0);

    /* Read with max. one retry in case of an error */
    do {
        retVal = Lpc177x_8x_MciReadBlock(buffer, blk, num);

