l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc177x_8x_mmcard_sdio.c
        if (retVal == MCI_FUNC_OK)
        {
            /*
             *  Reading blocks have started, now wait till this job is finished
             *  Please note the driver uses 16 word FIFO in the background to
             *  transfer the data under interrupt from the card
             */
            while (Lpc177x_8x_MciGetDataXferEndState() != 0);

            errorState = Lpc177x_8x_MciGetXferErrState();

            if ((num > 1) || errorState)
            {
                Lpc177x_8x_MciCmd_StopTransmission();
            }

            if (errorState)
            {
#ifdef NUTDEBUG
                printf("%s() failed\n", __FUNCTION__);
                Lpc177x_8x_MmcardShowStatusBits(errorState);
#endif

                // perform 1 retry in case of an error

                retVal = Lpc177x_8x_MciReadBlock(buffer, blk, num);

                if (retVal == MCI_FUNC_OK)
                {
                    /*
                     *  Reading blocks have started, now wait till this job is finished
                     *  Please note the driver uses 16 word FIFO in the background to
                     *  transfer the data under interrupt from the card
                     */
                    while (Lpc177x_8x_MciGetDataXferEndState() != 0);

                    errorState = Lpc177x_8x_MciGetXferErrState();

                    if ((num > 1) || errorState)
                    {
                        Lpc177x_8x_MciCmd_StopTransmission();
                    }

                    if (errorState)
                    {
#ifdef NUTDEBUG
                        printf("%s() failed again\n", __FUNCTION__);
                        Lpc177x_8x_MmcardShowStatusBits(errorState);
#endif
                        retVal = MCI_FUNC_FAILED;
                    }
                }
            }
        }
    } while (errorState && (retry-- > 0));

    /* Release mutex access. */
    NutEventPost(&mutex);

    return(retVal);
}

/*!
 * \brief write n-blocks of data, starting at blocknum. Wait for ending!
 *
 * \param buffer Pointer to the data buffer to write from.
 * \param blk    first blocknumber to write
 * \param num    Maximum number of blocks to write.
 *
 * \return A return value of <0 indicates an error.
 */
static uint32_t Lpc177x_8x_MmcardWriteData(uint8_t* buffer, int blk, int num)
{
    int32_t retVal;
    uint32_t errorState;


    /* Gain mutex access. */
    NutEventWait(&mutex, 0);

    retVal = Lpc177x_8x_MciWriteBlock(buffer, blk, num);

    if (retVal == MCI_FUNC_OK)
    {
        /*
         *  Writing blocks have started, now wait till this job is finished
         *  Please note the driver uses 16 word FIFO in the background to
         *  transfer the data under interrupt to the card
         */
        while (Lpc177x_8x_MciGetDataXferEndState() != 0);

        errorState = Lpc177x_8x_MciGetXferErrState();

        if ((num > 1) || errorState)
        {
            Lpc177x_8x_MciCmd_StopTransmission();
        }

        if (errorState)
        {
#ifdef NUTDEBUG
            printf("%s() failed\n", __FUNCTION__ );
            Lpc177x_8x_MmcardShowStatusBits(errorState);
#endif
            retVal = MCI_FUNC_FAILED;
        }
    }

    /* Release mutex access. */
    NutEventPost(&mutex);

    return(retVal);
}

/*!
 * \brief Initialize the multimedia card.
 *
 *
 * \param ifc Specifies the hardware interface.
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc177x_8x_MmcardInit(NUTDEVICE * dev)
{
    int32_t retVal;
    en_Mci_CardType cardType;
    uint32_t rcAddress;

    MCIFC *ifc = (MCIFC *) dev->dev_icb;

    /* set default for addressing mode */
    ifc->ifc_admode = MMC_BLOCK_MODE;

    /* reset card data */
    memset(ifc->ifc_csd, 0, sizeof(ifc->ifc_csd));
    memset(&cidval, 0, sizeof(st_Mci_CardId));

    /*********************************/
    /*          Init                 */
    /*********************************/
    retVal = Lpc177x_8x_MciInit(BRD_MCI_POWERED_ACTIVE_LEVEL);
    if (retVal != MCI_FUNC_OK)
    {
#ifdef NUTDEBUG
        printf("%s() MciInit failed\n", __FUNCTION__ );
#endif
        return((int)retVal);
    }

    /*********************************/
    /*          CardType             */
    /*********************************/
    cardType = Lpc177x_8x_MciGetCardType();

    if (cardType == MCI_CARD_UNKNOWN)
    {
#ifdef NUTDEBUG
        printf("%s() Get Card Type\n", __FUNCTION__ );
#endif
        return(MCI_FUNC_FAILED);
    }
    else
    {
        // the cardtype will tell us if BLOCK or BYTE addressing whould be used
        if (cardType == MCI_SDHC_SDXC_CARD)
        {
            ifc->ifc_admode = MMC_BYTE_MODE;
        }
    }

    /*********************************/
    /*              CID              */
    /*********************************/
    retVal = Lpc177x_8x_MciGetCID(&cidval);
    if (retVal != MCI_FUNC_OK)
    {
#ifdef NUTDEBUG
        printf("%s() Get CID failed\n", __FUNCTION__ );
#endif
        return((int)retVal);
    }

    /*********************************/
    /*          Card Address         */
    /*********************************/
    retVal = Lpc177x_8x_MciSetCardAddress();
    if (retVal != MCI_FUNC_OK)
    {
#ifdef NUTDEBUG
        printf("%s() Set card address failed\n", __FUNCTION__ );
#endif
        return((int)retVal);
    }
    else
    {
        rcAddress = Lpc177x_8x_MciGetCardAddress();
        ifc->ifc_reladdr = rcAddress;
    }


    /*********************************/
    /*              CSD              */
    /*********************************/
    retVal = Lpc177x_8x_MciGetCSD(ifc->ifc_csd);
    if (retVal != MCI_FUNC_OK)
    {
#ifdef NUTDEBUG
        printf("%s() GetCSD failed\n", __FUNCTION__ );
#endif
        return((int)retVal);
    }

    /*********************************/
    /*          Card Select          */
    /*********************************/
    retVal = Lpc177x_8x_MciCmd_SelectCard();

    if (retVal != MCI_FUNC_OK)
    {
#ifdef NUTDEBUG
        printf("%s() Card select CMD failed\n", __FUNCTION__ );
#endif
        return((int)retVal);
    }

