l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc177x_8x_mmcard_sdio.c
    /*********************************/
    /*          Bandwidth            */
    /*********************************/
    if (cardType == MCI_SDSC_V1_CARD || cardType == MCI_SDSC_V2_CARD || cardType == MCI_SDHC_SDXC_CARD)
    {
        Lpc177x_8x_MciSetClock( MCI_NORMAL_RATE );

        if (Lpc177x_8x_MciSetBusWidth( SD_4_BIT ) != MCI_FUNC_OK)
        {
            return((int)retVal);
        }
    }

    /*********************************/
    /*          BlockLength          */
    /*********************************/
    retVal = Lpc177x_8x_MciSetBlockLen(BLOCK_LENGTH);
    if (retVal != MCI_FUNC_OK)
    {
        return((int)retVal);
    }

    return(MCI_FUNC_OK);
}

/*!
 * \brief Read data blocks from a mounted partition.
 *
 * Applications should not call this function directly, but use the
 * stdio interface.
 *
 * \param nfp    Pointer to a ::NUTFILE structure, obtained by a previous
 *               call to MmCardMount().
 * \param buffer Pointer to the data buffer to fill.
 * \param num    Maximum number of blocks to read. However, reading
 *               multiple blocks is not yet supported by this driver.
 *
 * \return The number of blocks actually read. A return value of -1
 *         indicates an error.
 */
static int Lpc177x_8x_MmcardBlockRead(NUTFILE * nfp, void *buffer, int num)
{
    MMCFCB *fcb = (MMCFCB *) nfp->nf_fcb;
    uint32_t blk = fcb->fcb_blknum;
    NUTDEVICE *dev = (NUTDEVICE *) nfp->nf_dev;
    MCIFC *ifc = (MCIFC *) dev->dev_icb;

    if (buffer == 0)
    {
        buffer = fcb->fcb_blkbuf;
    }
    /*
     *  when using the filesystem, the sectornumbering is different then when
     *  directly accesing the card. For example, the MBR can be found at the
     *  sector 0 of the card, but the filesystem's first sector is the sector
     *  where the start is of the FAT VolumeID (also called the BOOT SECTOR).
     *  This position (or offset) is indicated by reading the partion-table,
     *  more specific: by reading the LBA begin info.
     *  This offset we need to add here to the sector# we get in as
     *  parameter. This way we acces the real sector on the card.
     *
     */
    if ((ifc->ifc_config & MBR_P_TABLE_NOT_PRESENT) == 0)
    {
        // only add offset if a partition table was present, else, don't add anything
        blk += fcb->fcb_part.part_sect_offs;
    }


    if (ifc->ifc_admode == MMC_BLOCK_MODE)
    {
        // apply addressing mode here
        blk *= BLOCK_LENGTH;
    }

    if (Lpc177x_8x_MmcardReadData(fcb->fcb_blkbuf, blk, num) == MCI_FUNC_OK)
    {
        // return the number of blocks that were succesfully read
        return(num);
    }

#ifdef NUTDEBUG
    printf("%s() failed\n", __FUNCTION__ );
#endif
    return(-1);
}

/*!
 * \brief Write data blocks to a mounted partition.
 *
 * Applications should not call this function directly, but use the
 * stdio interface.
 *
 * \param nfp    Pointer to a \ref NUTFILE structure, obtained by a previous
 *               call to MmCardMount().
 * \param buffer Pointer to the data to be written.
 * \param num    Maximum number of blocks to write. However, writing
 *               multiple blocks is not yet supported by this driver.
 *
 * \return The number of blocks written. A return value of -1 indicates an
 *         error.
 */
static int Lpc177x_8x_MmcardBlockWrite(NUTFILE * nfp, const void *buffer, int num)
{
    MMCFCB *fcb = (MMCFCB *) nfp->nf_fcb;
    uint32_t blk = fcb->fcb_blknum;
    NUTDEVICE *dev = (NUTDEVICE *) nfp->nf_dev;
    MCIFC *ifc = (MCIFC *) dev->dev_icb;


    if (buffer == 0)
    {
        buffer = fcb->fcb_blkbuf;
    }

    /*
     *  when using the filesystem, the sectornumbering is different then when
     *  directly accesing the card. For example, the MBR can be found at the
     *  sector 0 of the card, but the filesystem's first sector is the sector
     *  where the start is of the FAT VolumeID (also called the BOOT SECTOR).
     *  This position (or offset) is indicated by reading the partion-table,
     *  more specific: by reading the LBA begin info.
     *  This offset we need to add here to the sector# we get in as
     *  parameter. This way we acces the real sector on the card.
     *
     */

    if ((ifc->ifc_config & MBR_P_TABLE_NOT_PRESENT) == 0)
    {
        // only add offset if a partition table was present, else, don't add anything
        blk += fcb->fcb_part.part_sect_offs;
    }

    if (ifc->ifc_admode == MMC_BLOCK_MODE)
    {
        // apply addressing mode here
        blk *= BLOCK_LENGTH;
    }

    if (Lpc177x_8x_MmcardWriteData((uint8_t*)buffer, blk, num) == MCI_FUNC_OK)
    {
        return(num);
    }

#ifdef NUTDEBUG
    printf("%s() failed\n", __FUNCTION__ );
#endif
    return(-1);
}

/*!
 * \brief Mount a partition.
 *
 * Nut/OS doesn't provide specific routines for mounting. Instead routines
 * for opening files are used.
 *
 * Applications should not directly call this function, but use the high
 * level stdio routines for opening a file.
 *
 * \param dev  Pointer to the MMC device.
 * \param name Partition number followed by a slash followed by a name
 *             of the file system device. Both items are optional. If no
 *             file system driver name is given, the first file system
 *             driver found in the list of registered devices will be
 *             used. If no partition number is specified or if partition
 *             zero is given, the first active primary partition will be
 *             used.
 * \param mode Opening mode. Currently ignored, but
 *             \code _O_RDWR | _O_BINARY \endcode should be used for
 *             compatibility with future enhancements.
 * \param acc  File attributes, ignored.
 *
 * \return Pointer to a newly created file pointer to the mounted
 *         partition or NUTFILE_EOF in case of any error.
 */
static NUTFILE *Lpc177x_8x_MmcardMount(NUTDEVICE * dev, const char *name, int mode, int acc)
{
    int partno = 0;
    u_int i;
    NUTDEVICE *fsdev;
    NUTFILE *nfp;
    MMCFCB *fcb;
    DOSPART *part;
    MCIFC *ifc = (MCIFC *) dev->dev_icb;
    FSCP_VOL_MOUNT mparm;


    /* Set the card in SDIO mode and check for SD-HC cards. */
    if (Lpc177x_8x_MmcardInit(dev))
    {
        errno = ENODEV;
#ifdef NUTDEBUG
        printf("%s() Card init failed\n", __FUNCTION__ );
#endif
        return(NUTFILE_EOF);
    }

    ifc->ifc_config = 0;      // make sure a default is set before adding new info later on

    /* Parse the name for a partition number and a file system driver. */
    if (*name)
    {
        partno = atoi(name);
        do
        {
            name++;
        } while (*name && *name != '/');
        if (*name == '/')
        {
            name++;
        }
    }


