l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc177x_8x_mmcard_sdio.c
    /*
     * Check the list of registered devices for the given name of the
     * files system driver. If none has been specified, get the first
     * file system driver in the list. Hopefully the application
     * registered one only.
     */
    for (fsdev = nutDeviceList; fsdev; fsdev = fsdev->dev_next)
    {
        if (*name == 0)
        {
            if (fsdev->dev_type == IFTYP_FS)
            {
                break;
            }
        }
        else if (strcmp(fsdev->dev_name, name) == 0)
        {
            break;
        }
    }

    if (fsdev == 0)
    {
#ifdef NUTDEBUG
        printf("%s() FS driver not found\n", __FUNCTION__ );
#endif
        errno = ENODEV;
        return(NUTFILE_EOF);
    }

    if ((fcb = NutHeapAllocClear(sizeof(MMCFCB))) == 0)
    {
        errno = ENOMEM;
#ifdef NUTDEBUG
        printf("%s() Out of memory\n", __FUNCTION__ );
#endif
        return(NUTFILE_EOF);
    }

    // link this block-device driver with the file system device driver
    fcb->fcb_fsdev = fsdev;

    // Initialize MMC access mutex semaphore. */
    NutEventPost(&mutex);

    /* Read MBR. */
    if (Lpc177x_8x_MmcardReadData(fcb->fcb_blkbuf, 0, 1) != MCI_FUNC_OK)
    {
        NutHeapFree(fcb);
#ifdef NUTDEBUG
        printf("%s() Reading MBR failed\n", __FUNCTION__);
#endif
        return(NUTFILE_EOF);
    }


    // check sanity of MBR
    if ((fcb->fcb_blkbuf[510]!=0x55) || (fcb->fcb_blkbuf[511]!=0xAA))
    {
#ifdef NUTDEBUG
        printf("%s() Invalid MBR\n", __FUNCTION__ );
#endif
        NutHeapFree(fcb);

        return(NUTFILE_EOF);
    }

    /* Read partition table. */
    part = (DOSPART *) & fcb->fcb_blkbuf[DOSPART_SECTORPOS];
    for (i = 1; i <= 4; i++)
    {
        if (partno)
        {
            if (i == partno)
            {
                /* Found specified partition number. */
                fcb->fcb_part = *part;
                break;
            }
        }
        else if (part->part_state & 0x80)
        {
            /* Located first active partition. */
            fcb->fcb_part = *part;
            break;
        }
        part++;
    }

    if (fcb->fcb_part.part_type == PTYPE_EMPTY)
    {
#ifdef NUTDEBUG
        printf("%s() Invalid partition type\n", __FUNCTION__ );
#endif
        NutHeapFree(fcb);
        return(NUTFILE_EOF);
    }

#ifdef NUTDEBUG
    printf("Number of sectors %lu\n", fcb->fcb_part.part_sects);
    printf("Starting LBA %lu\n", fcb->fcb_part.part_sect_offs);
#endif

    if ((nfp = NutHeapAllocClear(sizeof(NUTFILE))) == 0)
    {
        NutHeapFree(fcb);
        errno = ENOMEM;
#ifdef NUTDEBUG
        printf("%s() Out of memory\n", __FUNCTION__ );
#endif
        return(NUTFILE_EOF);
    }

    nfp->nf_dev = dev;
    nfp->nf_fcb = fcb;


    /*
     * Mount the file system volume.
     */
    mparm.fscp_bmnt = nfp;
    mparm.fscp_part_type = fcb->fcb_part.part_type;

    if (fsdev->dev_ioctl(fsdev, FS_VOL_MOUNT, &mparm))
    {
#ifdef NUTDEBUG
        printf("%s() Mounting failed, try without partition table\n", __FUNCTION__ );
#endif
        // try again, this time leaving out the partition table offset
        ifc->ifc_config |= MBR_P_TABLE_NOT_PRESENT;

        if (fsdev->dev_ioctl(fsdev, FS_VOL_MOUNT, &mparm))
        {
            // failed again...
            // destroy allocated nfp block (and UNMOUNT the FS (again))
            Lpc177x_8x_MmcardUnmount(nfp);

#ifdef NUTDEBUG
            printf("%s() No FAT filesystem found, mounting failed\n", __FUNCTION__ );
#endif
            NutHeapFree(fcb);
            return(NUTFILE_EOF);
        }

    }

    return(nfp);
}

/*!
 * \brief Unmount a previously mounted partition.
 *
 * Applications should not directly call this function, but use the high
 * level stdio routines for closing a previously opened file.
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc177x_8x_MmcardUnmount(NUTFILE * nfp)
{
    int rc = -1;

    if (nfp)
    {
        MMCFCB *fcb = (MMCFCB *) nfp->nf_fcb;

        if (fcb)
        {
            rc = fcb->fcb_fsdev->dev_ioctl(fcb->fcb_fsdev, FS_VOL_UNMOUNT, NULL);
            NutHeapFree(fcb);
        }
        NutHeapFree(nfp);
    }

#ifdef NUTDEBUG
    if (rc != 0)
    {
        printf("%s() failed\n", __FUNCTION__ );
    }
#endif
    return(rc);
}


/*!
 * \brief Perform MMC control functions.
 *
 * This function is called by the ioctl() function of the C runtime
 * library. Applications should not directly call this function.
 *
 * \todo Card change detection should verify the serial card number.
 *
 * \param dev  Identifies the device that receives the device-control
 *             function.
 * \param req  Requested control function. May be set to one of the
 *             following constants:
 *             - \ref NUTBLKDEV_MEDIACHANGE
 *             - \ref NUTBLKDEV_INFO
 *             - \ref NUTBLKDEV_SEEK
 *             - \ref MMCARD_GETCID
 *             - \ref MMCARD_GETCSD
 *
 * \param conf Points to a buffer that contains any data required for
 *             the given control function or receives data from that
 *             function.
 * \return 0 on success, -1 otherwise.
 */
static int Lpc177x_8x_MmcardIOCtl(NUTDEVICE * dev, int req, void *conf)
{
    int rc = 0;

    switch (req)
    {
        case NUTBLKDEV_MEDIAAVAIL:
            {
                *((int *) conf) = 1;
            }
            break;
        case NUTBLKDEV_MEDIACHANGE:
            {
                *((int *) conf) = 0;
            }
            break;
        case NUTBLKDEV_INFO:
            {
                BLKPAR_INFO *par = (BLKPAR_INFO *) conf;
                MMCFCB *fcb = (MMCFCB *) par->par_nfp->nf_fcb;

                /*
                 *  note that we don't read the card's CSD-register for this info,
                 *  in stead, we use the info that we found in the partition table of
                 *  the formatted card.
                 */
                //
                par->par_nblks = fcb->fcb_part.part_sects;
                par->par_blksz = MMC_BLOCK_SIZE;
                par->par_blkbp = fcb->fcb_blkbuf;
            }
            break;
        case NUTBLKDEV_SEEK:
            {
                BLKPAR_SEEK *par = (BLKPAR_SEEK *) conf;
                MMCFCB *fcb = (MMCFCB *) par->par_nfp->nf_fcb;

                fcb->fcb_blknum = par->par_blknum;
            }
            break;
        case MMCARD_GETSTATUS:
            rc = Lpc177x_8x_MciGetCardStatus((int32_t*) conf);
            break;
        case MMCARD_GETCID:
            // not possible to issue a single CID command here so return the
            // captured value from init
            memcpy((st_Mci_CardId*)conf, &cidval, sizeof(st_Mci_CardId));
            break;
        case MMCARD_GETCSD:
            // not possible to issue a single CSD command here so return the
            // captured value from init
            memcpy((st_Mci_CardId*)conf, &mci0_ifc.ifc_csd, sizeof(mci0_ifc.ifc_csd));
            break;
        default:
            rc = -1;
            break;
    }
    return(rc);
}


/*!
 * \brief Multimedia card device information structure.
 *
 * A pointer to this structure must be passed to NutRegisterDevice()
 * to bind this driver to the Nut/OS kernel. An application may then
 * call
 * /verbatim
 * _open("MMC0:", _O_RDWR | _O_BINARY);
 * /endverbatim
 * to mount the first active primary partition with any previously
 * registered file system driver (typically devPhat0).
 */
NUTDEVICE devLpcMci0 = {
    0,                          /*!< Pointer to next device, dev_next. */
    {'M', 'M', 'C', '0', 0, 0, 0, 0, 0}
    ,                           /*!< Unique device name, dev_name. */
    0,                          /*!< Type of device, dev_type. Obsolete. */
    0,                          /*!< Base address, dev_base. Unused. */
    0,                          /*!< First interrupt number, dev_irq. Unused. */
    &mci0_ifc,                  /*!< Interface control block, dev_icb. */
    0,                          /*!< Driver control block used by the low level part, dev_dcb. */
    Lpc177x_8x_MmcardInit,      /*!< Driver initialization routine, dev_init. */
    Lpc177x_8x_MmcardIOCtl,     /*!< Driver specific control function, dev_ioctl. */
    Lpc177x_8x_MmcardBlockRead, /*!< Read data from a file, dev_read. */
    Lpc177x_8x_MmcardBlockWrite,/*!< Write data to a file, dev_write. */
    Lpc177x_8x_MmcardMount,     /*!< Mount a file system, dev_open. */
    Lpc177x_8x_MmcardUnmount,   /*!< Unmount a file system, dev_close. */
    0,                          /*!< Return file size, dev_size. */
    0,                          /*!< Select function, optional, not yet implemented */
};


/*@}*/
